{"Page 1": "The company had sold 13,119 units in the same month last year, Ashok Leyland said in a statement. Domestic commercial vehicle sales were down 25% at 9,377 units as against 12,570 units in the year-ago month, it added. Medium and heavy commercial vehicle sales in the domestic market were down 36% to 5,321 units as compared to 8,260 units in November last year.", "Page 2": "\"We have consciously lowered the volume of vehicles sold to dealers to ensure lean inventory/avoid high market offers, we are adjusting our production to ensure we do not put any excess burden on our dealerships before the shift to BS-VI in April 2020,\" TKM Deputy Managing Director N Raja said.", "Page 3": "Rahul Bajaj raised his concerns over lack of freedom of speech when it comes to criticising the BJP-led govt.", "Page 4": "This tepidity will linger: Higher financing costs and new BS VI blow are just around the corner.", "Page 5": "Total domestic sales were down 25 per cent at 38,057 units as compared to 50,470 units in November last year, it added. Passenger vehicle sales in the domestic market during the month stood at 10,400 units as against 16,982 units in the same month previous year, down 39 per cent. ", "Page 6": "Domestic sales were up 2 per cent at 44,600 units as against 43,709 units in November 2018, the company added. Exports stood at 15,900 units in the last month, up 25.2 per cent from 12,702 units in November 2018. ", "Page 7": "The company had sold 45,101 units in the corresponding month last year, M&M said in a regulatory filing. In the domestic market, sales were down 7 per cent at 38,614 units last month as compared to 41,564 units in November 2018.", "Page 8": "The investment to be committed by Ather would be Rs around Rs 635 crore and estimated to create 4300 jobs. A mail has been sent to Ather with queries about the period over which the investments would be committed. ", "Page 9": "The company accomplished this landmark number in less than 37 years of selling its first car on December 14,1983, when it first rolled out the iconic Maruti 800, Maruti Suzuki India (MSI) said. The company said while it crossed 10 million vehicle sales in nearly 29 years, the next 10 million passenger vehicles were sold in a record time of 8 years.", "Page 10": "The partnership will allow end-of-life ZS EV batteries to be recycled, thus ensuring greater peace of mind to MG customers about their ecological footprint, the company said in a statement.", "Page 11": "Mahindra said that FCA has filed a counterclaim in the proceeding filed by it before the Eastern District Court of Michigan, seeking a permanent injunction on manufacture or sales of the Roxor, as well as disgorgement of any profits made by the Mahindra & Mahindra (M&M) from sales of the vehicle. ", "Page 12": "EESL emerged as the qualified bidder for setting up about 600 charging stations in about a dozen cities, while REIL won 1,000 tenders. NTPC is likely to get contracts for 200 charging stations, while PowerGrid may qualify for about 10 charging stations. About 50 bids were received from private companies for tenders, but the companies did not qualify.", "Page 13": "Both Ola and Uber declined comment on the development. The tender is likely to be floated in January 2020, around the time when foreign automakers such as BMW are expected to launch their electric cars in India. Currently, Hyundai's Kona is the only car present in the premium electric car segment.", "Page 14": "German luxury car maker Mercedes-Benz on Wednesday marked 25 years of producing vehicles in India where it has sold around 1.1 lakh locally made cars.", "Page 15": "Workers of Honda Motorcycle & Scooter India's (HMSI) Manesar plant on Wednesday took out a march to protest against the sacking of 2,500 contractual workers at the facility.", "Page 16": "The fair trade regulator said it has approved the minority stake purchase deal of Toyota Motor Corporation and Suzuki Motor Corporation."}