{"Page1": "NEW DELHI: Hinduja flagship firm Ashok Leyland on Monday reported a 22 per cent decline in total commercial vehicle sales at 10,175 units in November.\n\nThe company had sold 13,119 units in the same month last year, Ashok Leyland said in a statement.\n\nDomestic commercial vehicle sales were down 25 per cent at 9,377 units as against 12,570 units in the year-ago month, it added.\n\nMedium and heavy commercial vehicle sales in the domestic market were down 36 per cent to 5,321 units as compared to 8,260 units in November last year.\n\nSimilarly, light commercial vehicle sales were down 6 per cent at 4,056 units as against 4,310 units in the corresponding month last year, the company said. \n\n", "Page2": "Toyota Kirloskar Motor (TKM) on Monday reported 18.86 per cent decline in total sales for November 2019 at 9,241 units.\n\nThe company had sold 11,390 units in the same month last year, TKM said in a statement.\n\nDomestic sales stood at 8,312 units as against 10,721 units in the year-ago month, a decline of 22 per cent, it added.\n\nThe company has been doing pipeline correction to liquidate stocks by December and work towards a smooth transition to BS VI, TKM said.\n\nExports, however, were up 38.86 per cent at 929 units in November as compared to 669 units in the same month a year ago.\n\n\"We have consciously lowered the volume of vehicles sold to dealers to ensure lean inventory/avoid high market offers, we are adjusting our production to ensure we do not put any excess burden on our dealerships before the shift to BS-VI in April 2020,\" TKM Deputy Managing Director N Raja said.\n\nHe further said positive sentiments in the market have continued to November 2019 which has reflected in the spike in customer orders across all models.\n\nThe boost in customer orders for all models has sustained last month even after the end of festive season. Customers are aware of the model year price rise in January and the significant price hike of diesel vehicles by 15-20 per cent post BS-VI transition, he added.\n\n\"This pre-buying pull of BS-IV vehicles has helped us in pushing retail sales and also enabling successful runout of products before shift to BS-VI,\" Raja said, adding TKM is also readjusting its production plan to be able to match supply to the increased customer demand.\n\nOn the near-term outlook, Raja said,\"We hope this pace in retail sales continues to year end.\"\n\n", "Page3": "On many occasions, the views of Rajiv Bajaj, the managing director of Bajaj Auto and his father cum boss, chairman Rahul Bajaj are not on the same page. They often agree to disagree. While Bajaj senior’s comments at ET awards has garnered a lot of headlines, Rajiv was less enthused. Edited excepts from an interview to \nSatish John.\n\n\n\nRahul Bajaj, Bajaj Auto chairman’s remarks on Saturday evening has attracted a lot of attention.\nHow do you see this?\nWell a durbar to him (Rahul Bajaj) is like a red carpet to a bull!\n\nHe revels in such an opportunity. Though personally I’m not sure of the relevance of raising such a sensitive and subjective issue at a public function to celebrate corporate excellence.\n\nYes, he has always been uncommonly courageous in this respect and people do admire him for it.\n\nYet I also remember reading somewhere that ‘courage is knowing that it may hurt and doing it anyway. Stupidity is the same. And that’s what makes life hard’.\n\nThat’s why nobody joins him; they conveniently cheer from the sidelines.\n\n\nHe mentioned that the government is sensitive to criticism, unlike the UPA government. You have also been critical of the government in the past whether it was demonetisation or the deadline set for EVs. Did your group or you face any retribution?\n\nGiven the nature of my business, my engagement with the government is fortunately limited. My most frequent interactions have been with Mr Amitabh Kant, CEO, Niti Aayog.\n\nI’ve also had occasion to meet with Mr Nitin Gadkari and Mr Piyush Goyal on several occasions. As is well known, I’ve had my differences with them on certain important issues such as electric vehicle policy. Rarely what’s been said or how it’s been said has left a poor taste. That’s fine though as I suppose that I may have been guilty of the same as well. So it’s a fair exchange no robbery.\n\n\nAt a Nasscom event in February 2017 in Mumbai, I used demonetisation as an example to draw a distinction between the failure of an idea vs that of its execution.\n\nThat was misrepresented as a unilateral criticism of demonetisation.\n\nSo many well-wishers warned me that there would be trouble for me and for Bajaj Auto! Some even said that given their reputation for vindictiveness this government would now never approve of our quadricycle the Qute for which we’d been struggling for years. And in the context of which I’d made the made in India comment about made in India!\n\nHowever, what happened was the exact opposite for coincidentally at the same time I’d requested appointments with Mr Kant and Mr Gadkari. I was immediately granted an audience, greeted warmly, heard patiently. and within a year we got approval for what had been stuck in government for 8 years.\n\n\nBusinessmen are wary of the income tax department. Enforcement Directorate and the heavy arm that the government has in prevailing over businesses. Do you think that’s unfair of the government to use agencies as they will?\nFortunately, I’ve personally never experienced this so I can’t relate to it.\n\n\n", "Page4": "NEW DELHI| MUMBAI: Demand for passenger vehicles tailed off last month after a festiveseason spike in October, with sluggishness in the broader economy putting the brakes on auto sales. Higher financing costs and the industry’s impending transition to BS VI emission norms will likely keep sales muted in the medium term.\n\nMaruti Suzuki, which sells one of two cars running on Indian roads, saw sales decline over 3%.\n\nSales of mini cars (Alto, S-Presso, and old WagonR) declined 12% to 26,306 units, while those of compacts (New WagonR, Swift, Dzire, Baleno, Celerio, and Ignis) increased 7.6% to 78,013 units.\n\nSales of Maruti’s utility vehicles (XL6, Ertiga, Vitara Brezza, and S-Cross) declined 1.3% to 23,204 units.\n\n“October was encouraging in terms of retail sales. With the festive season over, we have to watch very carefully how demand pans out over the next few months,” said Shashank Srivastava, executive director (marketing and sales) at Maruti Suzuki. “There are several negative factors.\n\nVehicle acquisition prices have increased because of implementation of safety and emission regulations, and financing continues to be an issue. Besides, the industry is readying to transition to BS VI.”\n\nAt Mahindra & Mahindra (M&M), sales fell 10% to 14,637 units last month. Veejay Ram Nakra, chief of sales and marketing (automotive division), M&M said: “The month after the festive season is historically a lean month for the automotive industry.\n\n\n\nConsumer demand, especially for PVs, typically picks up in the year-end, or in December. Therefore, we expect December to pan out better for the automotive industry.”\n\nHyundai bucked the trend to report a growth of 2%, selling 44,600 units in the month under review. The company’s newly launched sports utility vehicle Venue helped boost numbers and is expected to register 100,000 bookings by the end of the year.\n\nVikas Jain, national sales head at Hyundai, said that market conditions are “challenging”, but said that Grand i10 Nios, Elite i20, Venue and Creta helped boost volumes last month.\n\nNew entrant MG Motor India sold 3,239 units of SUV Hector in the month under review; Volkswagen raised volumes 17.4% to sell 2,937 units.\n\nAt Tata Motors, passenger vehicle sales dropped 39% to 10,400 units. The company said its retail sales exceeded dealer dispatches by 15%, which helped reduce the network stock by 35% in this fiscal.\n\n", "Page5": "New Delhi: Tata Motors on Sunday reported a 25.32 per cent decline in total sales to 41,124 units in November. The company had sold a total of 55,074 units in the same month last year, Tata Motors said in a statement. \n\nTotal domestic sales were down 25 per cent at 38,057 units as compared to 50,470 units in November last year, it added. \n\nPassenger vehicle sales in the domestic market during the month stood at 10,400 units as against 16,982 units in the same month previous year, down 39 per cent. \n\nSimilarly, the company reported 19 per cent decline in total commercial vehicle sales at 30,588 units as against 37,957 units in the year-ago period.\n", "Page6": "NEW DELHI: Hyundai Motor India Ltd (HMIL) on Sunday reported a 7.2 per cent increase in total sales at 60,500 units in November. The company had sold 56,411 units in the same month last year, HMIL said in a statement. \n\n Domestic sales were up 2 per cent at 44,600 units as against 43,709 units in November 2018, the company added. \n\n Exports stood at 15,900 units in the last month, up 25.2 per cent from 12,702 units in November 2018.\n", "Page7": "NEW DELHI: Auto major Mahindra and Mahindra (M&M) on Sunday reported a 9 per cent decline in total sales in November at 41,235 units. The company had sold 45,101 units in the corresponding month last year, M&M said in a regulatory filing.\n\nIn the domestic market, sales were down 7 per cent at 38,614 units last month as compared to 41,564 units in November 2018.\n\nExports also declined 26 per cent to 2,621 units as against 3,537 units in the year-ago month.\n\nIn the passenger vehicle segment, which includes utility vehicles, cars and vans, the company sold 14,637 units last month as compared to 16,188 units in the same month last year, down 10 per cent.\n\nIn the commercial vehicle segment, the company sold 17,384 units in November as against 19,673 units in the same month a year ago, down 12 per cent.\n\n\"The month post festive season is historically a lean month for the automotive industry. Consumer demand, especially for passenger vehicles, typically picks up in the year-end that is in December. Therefore, we expect December to pan out better for the automotive industry,\" M&M Chief of Sales and Marketing, Automotive Division, Veejay Ram Nakra said.\n\nDomestic sales in farm equipment segment in November stood at 20,414 units as against 25,159 units in the same month last year.\n\nExports for the month stood at 618 units.\n\nTotal tractor sales (domestic + exports) during November 2019 stood at 21,032 units as against 25,949 units in the same month last year.\n\nCommenting on the performance, Rajesh Jejurikar, President - Farm Equipment Sector, Mahindra & Mahindra Ltd said: \"We have sold 20,414 tractors in the domestic market during November 2019. With government support on agri and rural sector and healthy reservoir levels due to the above normal monsoon, we expect a good Rabi output in the coming months\". \n\n", "Page8": "CHENNAI: Bengaluru-based electric vehicle company Ather will set up its two-wheeler factory and battery pack making unit in Hosur along the Tamil Nadu-Karnataka border, state chief minister Edappadi K Palaniswami revealed at aninvestment and skill development conclave in the city on Saturday.\n\nThe investment to be committed by Ather would be Rs around Rs 635 crore and estimated to create 4300 jobs. A mail has been sent to Ather with queries about the period over which the investments would be committed. \n\nThe Ather deal follows of raft of similar projects announcements in Tamil Nadu recently: in late September, the state government announced deals worth nearly Rs 120 crore in the electric vehicle and component manufacture space. German group Mahle Electric and Japan's Nissei will set up manufacturing ventures in Tamil Nadu. \n\nChief Minister Palaniswami also announced a slew of other investments totalling Rs 5,027 crore roped in by the Tamil Nadu Investment Promotion and Guidance Bureau: the Indian subsidiary of Chinese electric vehicle company BYD Group China is returning to Tamil Nadu to manufacture phone components with an investment of Rs 694 crore; earlier it was present in the state’s electronics manufacturing corridor near Chennai. \n\nSpeaking about the efforts of his government to leverage Tamil Nadu's position as a industrial powerhouse, Palaniswami said 53 deals signed with corporates in the Global Investors Meet 2019 in January have reached the stage of commercial production. Chief Minister Edappadi K Palaniswami spoke about Finnish company Salcomp buying the Nokia factory inside the Nokia Telecom SEZ, and Foxconn restarting production at its unit inside the SEZ. ET had reported on Friday that Foxconn has restarted manufacturing activity inside the 212-acre SEZ.\n\n Palaniswami also announced a memorandum of Understanding with the DRDO for for defence technologies and systems and an MoU with Defence tech company Data Patterns for manufacture of radar and communication technology systems. \n\nAccording to a PIB release in July this year, the Ordinance Factory Board, Defence Public Sector Units and private industries have committed to invest Rs 3100 crore in the Tamil Nadu defence corridor–a string factories for defence-related production.\n\nOther memorandums of understanding included a Rs 515 crore investment by ITC Paper, Rs 503 crore from Japanese automotive component maker Mitsuba Sical, and inaugurated Rs 112-crore worth corporate projects in enterprise security, AI-enabled education and privacy and governance.\n\n", "Page9": "The country's largest car maker Maruti Suzuki India on Saturday said it has crossed milestone of 20 million passenger vehicle cumulative sales in the Indian market.\n\nThe company accomplished this landmark number in less than 37 years of selling its first car on December 14,1983, when it first rolled out the iconic Maruti 800, Maruti Suzuki India (MSI) said in a statement.\n\nThe company said while it crossed 10 million vehicle sales in nearly 29 years, the next 10 million passenger vehicles were sold in a record time of 8 years.\n\nCommenting on the milestone, MSI Managing Director & CEO Kenichi Ayukawa said, \"We are overwhelmed with this new record. Achieving this milestone is a great accomplishment for Maruti Suzuki, as well as our suppliers and dealer partners\".\n\nMSI said it has introduced factory fitted CNG vehicles as well as smart hybrid vehicles, in addition to eight BS6 models rolled out much ahead of the stipulated timelines.\n\nIt along with its parent, Suzuki Motor Corporation, plans to introduce a small EV for the Indian market. Currently, it is road testing 50 electric Vehicle prototypes across the country to check their real-life performance in multiple terrains and varied climatic conditions, it added.\n\n", "Page10": "NEW DELHI: MG Motor India on Friday said it has partnered with battery life-cycle management firm Umicore for recycling end-of-life batteries of its upcoming electric SUV ZS EV.\n\nThe partnership will allow end-of-life ZS EV batteries to be recycled, thus ensuring greater peace of mind to MG customers about their ecological footprint, the company said in a statement.\n\n\"Our partnership with Umicore focuses on end-of-life applications for used EV battery packs and ensures that exhausted battery packs of MG ZS EV are recycled in keeping with the global best standards, to ensure environment-friendly battery disposal,\" MG Motor India Chief Commercial Officer Gaurav Gupta said.\n\nOver the past few months, the company has worked towards creating the right ecosystem for its customers ahead of the launch of the ZS EV, including charging infrastructure, he added.\n\nUmicore India Country General Manager and spokesperson Kedar Rele said MG is addressing concerns about the disposal of end-of-life EV batteries for recycling.\n\nThe company will offer its 'closed loop' sustainable recycling solution that ensures minimal waste and impact on the environment.\n\n\"This is vital to the commitment of facilitating EV adoption and catalysing India's nascent EV revolution,\" Rele added.\n\nEarlier this week, MG Motor India had announced similar partnership with Exicom Tele-Systems for recycling of used batteries of SUV ZS EV.\n\n", "Page11": "NEW DELHI: Mahindra & Mahindra on Friday said a judge of the US International Trade Commission (ITC) has found that its off-road vehicle Roxor violated Fiat Chrysler Automobile's (FCA) Jeep 'trade dress' and recommended an exclusion order prohibiting import and sale of any already imported parts of the vehicle. \n\nThe homegrown auto major further said that FCA has filed a counterclaim in the proceeding filed by it before the Eastern District Court of Michigan, seeking a permanent injunction on manufacture or sales of the Roxor, as well as disgorgement of any profits made by the Mahindra & Mahindra (M&M) from sales of the vehicle. \n\n \"If FCA succeeds in getting a permanent injunction, then Mahindra Automotive North America, a subsidiary of the company, will no longer be able to sell Roxors in the US,\" M&M said in a regulatory filing. \n\n On the US ITC order, the company said \"the Administrative Law Judge (ALJ) has, in his initial determination, found that while the design of the Roxor vehicle does not violate any of FCA's registered trademarks, it violated FCA's trade dress and recommended an exclusion order prohibiting the importation of Roxor parts and a cease-and-desist order prohibiting sale of any already imported Roxor parts.\" \n\n Trade dress is a form of intellectual property that identifies the look of a product and distinguishes it from its competitors. \n\n The firm, however, said the initial determination made by the Administrative Law Judge of the ITC is a non-binding recommendation to the ITC and the company has asked the same to be reviewed. \n\n When contacted, a company spokesperson said, \"...until this case, FCA had never defined what it believes to be the 'Jeep Trade Dress' or identified it as a business asset in any filings (bankruptcy or otherwise).\" \n\n The spokesperson further said, \"Ultimately, the ALJ's opinion is only a recommendation, and we have asked the entire ITC to review it\". \n\n The ITC has the discretion to either adopt the ALJ's opinion in whole or in part, rewrite parts of it, or completely reject it. Therefore, it is very important to wait for the ITC review to be finalised, the spokesperson added. \n\n Roxor was launched on March 2, 2018, to be sold in the US and Canada. Soon after, FCA lodged a complaint with the US ITC alleging that it is a copy of Willys Jeep and the design elements of Mahindra's product infringes some key design elements of Jeep. \n\n Roxor is manufactured in Auburn Hills, Michigan. Mahindra has invested hundreds of millions of dollars into building its US operations and currently operates multiple facilities in the Detroit area. \n\n It employs more than 400 US employees and hundreds more through its network of over 400 dealers and US suppliers, the spokesperson said.\n", "Page12": "NEW DELHI: State-owned Rajasthan Electronics & Instruments Ltd (REIL) and Energy Efficiency Services Ltd (EESL) have bagged a significant chunk of orders for setting up more than 2,500 e-vehicle charging stations in about 90 cities across the country. No private sector company has qualified. \n\nAbout 50 bids were received from private companies for tenders floated under the Centre’s second phase of Faster Adoption and Manufacturing of (Hybrid &) Electric Vehicles in India (Fame-II) scheme, but the companies did not qualify as they had to bid through nominated agencies for the states, sources said. \n\nTwo of the private bidders told ET declined to comment till the results of the tenders are made official. \n\n\"We will evaluate the results and the documents once an official statement about the results is made,\" an executive at one of the private bidders said. \n\nOf the Rs 10,000 crore Fame II scheme, Rs 1,000 crore has been earmarked as subsidy for setting up the charging stations. \n\nThe Department of Heavy Industry received a total of 100 bids from public and private companies in response to tenders for setting up public charging stations for electric vehicles. \n\nEESL emerged as the qualified bidder for setting up about 600 charging stations in about a dozen cities, while REIL won 1,000 tenders. NTPC is likely to get contracts for 200 charging stations, while PowerGrid may qualify for about 10 charging stations. \n\nA senior EESL official said the company would set up charging stations in a dozen cities, including Delhi, Mumbai, Ahmedabad, Kolkata, Hyderabad, Bengaluru, Chennai, Noida and Chandigarh. \n\nREIL will set up the charging infrastructure in about 50 cities. \n\nUrban local bodies of Dehradun, Guwahati and Tirupati; and municipal corporations of Navi Mumbai and Bhubaneswar also could bag some of the contracts. \n\nAbout 1,000 charging stations will be set up in about seven cities, including Delhi, Mumbai, Hyderabad, Kolkata and Ahmedabad, with populations of over four million, sources said. \n\nThe focus of the Fame II scheme is electrification of public and shared transportation and laying of charging infrastructure for electric vehicles. \n\nThe government targets to set up one charging station for every three km in cities and every 25 km on both sides of highways. The tariff for supply of electricity to electric vehicle public charging stations shall not be more than the average cost of supply plus 15%, according to the power ministry’s guidelines. The states will fix a ceiling on service charges for the public charging stations. \n\nEarly last year, the ministry had issued a notification clarifying that setting up charging stations for electric vehicles will not require a separate licence under the Electricity Act, 2003. \n\nThe power ministry issued guidelines in December last year for charging infrastructure, under which it asked public charging stations to install both Japanese and European charging platforms. \n\n", "Page13": "NEW DELHI: State-run Energy Efficiency Services Ltd (EESL) is set to float a tender for procurement of electric luxury cars, possibly in the range of Rs 25 lakh each, which it plans to lease out to cab aggregators like Ola and Uber, people aware of development said.\n\n“EESL may go for a small procurement of 200 cars, to be used in the shared-mobility segment,” said a source aware of the development.\n\n“Proposals have been sent to Ola and Uber for leasing out 50 cars to each aggregator, while purely electric ride-hailing service Blu Smart has also evinced interest for such cars,” the person added.\n\nBoth Ola and Uber declined comment on the development. The tender is likely to be floated in January 2020, around the time when foreign automakers such as BMW are expected to launch their electric cars in India. Currently, Hyundai's Kona is the only car present in the premium electric car segment.\n\nChina’s MG Motor is likely to launch its electric SUV MG ZS EV next month.\n\nBlu Smart promoter Anmol Singh Jaggi told ET that it has a requirement of around 100 luxury SUVs, which it wants to deploy in its existing fleet of over 500 electric sedans it procured from EESL. “EESL is also expected to generate demand for these cars from central ministries and PSUs,” said a second source.\n\n“EESL is also expected to generate demand for these cars from central ministries and PSUs,” said a second source.\n\nWhile the tender specifications have not been finalised yet, EESL is likely to make it more conducive for a larger set of players.\n\nEESL’s first tender for procurement of 10,000 electric sedans launched amid much fanfare, did not garner a similar response from central and state governments and the company procured only 3,000 sedans. \n\n", "Page14": "NEW DELHI: German luxury car maker Mercedes-Benz on Wednesday marked 25 years of producing vehicles in India where it has sold around 1.1 lakh locally made cars. The company had first started assembling cars in India in 1994 with its production site located in the Tata Motors (then Telco) premises before shifting to its own unit. \n\n It is also celebrating 10 years of new manufacturing plant at Chakan in Pune, which was inaugurated in 2009. The company has invested Rs 2,200 crore till date at the facility which is spread over 100 acres. Around 730 people work at the plant. \n\n Mercedes-Benz portfolio produced in Pune comprises a wide range of models Sedans of the C-Class, E-Class, S-Class and CLA Coupe as well as Maybach S-Class and SUVs GLA, GLC, GLE and GLS, the company said in a statement. \n\n Mercedes-Benz AG member of the board of management, production and supply chain management Jorg Burzer said, \"To produce, where our customers are located, distinguishes our Mercedes-Benz Cars global production network...As the country's largest luxury carmaker, both anniversaries celebrated this year are significant landmarks for us, the region of Pune and an important sign for the local luxury car market in India.\" \n\n Mercedes-Benz India executive director, operations Piyush Arora said the Chakan manufacturing facility is the backbone of the company's growth story in India and, serves a very important role within the network especially for setting up a new local assembly facility or ramp up of series production across geographies. \n\n \"From its humble beginning 25 years back to its current position of strength of being a leading local assembly plant in the global production network, Mercedes-Benz India has successfully established the prowess of local manufacturing in India,\" he added. \n\n Last year, the company had said it has crossed 1 lakh sales milestone of locally assembled cars in India. In the January-September period this year, it has sold 9,915 units. \n\n Mercedes-Benz India Managing Director and CEO Martin Schwenk said the milestone of completion of 25 years for Mercedes-Benz is a tribute to its customers who have been appreciating the company's products and services. \n\n \"This success is also a result of the relentless contribution of passionate people behind the brand, which includes our employees, dealer partners, their teams and our suppliers,\" he added.\n", "Page15": "NEW DELHI: Workers of Honda Motorcycle & Scooter India's (HMSI) Manesar plant on Wednesday took out a march to protest against the sacking of 2,500 contractual workers at the facility. The workers marched from the plant to Gurugram Mini Secretariat. \n\n A worker union leader claimed that around 5,000 workers participated in the protest. \n\n The Japanese two-wheeler major had resumed operations at the plant earlier this week with permanent employees joining work. \n\n HMSI had suspended operations at the plant from first week of November as workers protested for over a week against the retrenchment of their contractual colleagues. \n\n The stand off at the facility, which employs around 1,900 permanent workers and 2,500 contract workers, began on morning of November 5 when the company management did not allow some of the contractual workers to go inside the plant. \n\n The sacked contractual workers, though, continue to protest at the site. \n\n \"Around 5,000 workers participated in the protest march today. Workers from other factories also joined us in the protest,\" a senior HMSI worker and union leader told . \n\n The workers handed over a memorandum to the government officials at the Secretariat and sought their help in reinstating sacked contractual workers, he added. \n\n The worker union also demanded revocation of suspension of six of their members. \n\n The workers under the Trade Union Council also demanded that the government should look into problems of other manufacturing units in Manesar/Gurugram region. \n\n On November 22, HMSI workers had taken out a protest march from Manesar plant to Gurugram Deputy Commissioner's office. \n\n When contacted, HMSI said over 1,350 permanent staff associates have joined back duty as on November 27 and the last batch is expected to join on November 28. \n\n \"We are steadily moving towards regular operations with discipline, good faith and positivity,\" the company said in a statement. \n\n The decision to resume production at Manesar plant was initiated on November 22 and all permanent staff associates were informed to join duty from November 25 to November 28 in four batches. \n\n The HMSI Employee Union leaders had alleged that the company had reduced production by 50 per cent at the Manesar facility and is in the process of retrenching contractual workers. \n\n The plant has three assembly lines -- two for motorcycles and one for scooters.\n", "Page16": "NEW DELHI: The Competition Commission of India on Tuesday said it has approved the minority stake purchase deal of Toyota Motor Corporation and Suzuki Motor Corporation. The transaction involves acquisition of a \"minority and insignificant shareholding\" of 4.94 per cent by Toyota Motor in Suzuki Motor while Suzuki will hold approximately 0.24 per cent stake in the former, a statement said. \n\n The fair trade regulator also said that the purpose of the proposed transaction is to \"establish and promote a long-term partnership\" between the two firms for future collaborations in new fields, including the autonomous driving filed. \n\n\"Although both the parties are active in the broad automobile sector in India, their overlapping business activities arise only in the relevant markets of compact passenger cars and mid-size passenger cars\" the statement added. \n\n\n"}